<template>
  <div class="space-y-6">
    <div class="border-b border-slate-200 pb-5">
      <h1 class="text-2xl font-bold tracking-tight text-slate-900">Форум мастеров (Гильдии и технические дискуссии)</h1>
      <p>Специализированное структурированное пространство для профессионального общения, решения сложных инженерных проблем и взаимопомощи.</p>
      <p></p>
      <ul class="mt-1 text-sm text-slate-500">
        <li>Зачем нужна: Пространство, где мастера помогают друг другу решать сложные узкопрофильные задачи. Настоящий аналог «Stack Overflow» для строителей, проектировщиков, IT-специалистов и архитекторов.</li>
        <li>Формат контента: Дерево категорий, разделенное по профессиональным Гильдиям (Строительство, IT, Архитектура и т.д.), с ветками обсуждений (тредами), поддержкой разметки кода, вставкой схем узлов примыкания и голосованиями.</li>
        <li>Логика работы: Пользователь создает тему с технической проблемой. Другие верифицированные мастера предлагают свои решения. Ответ, набравший максимальное количество лайков от коллег по цеху, автоматически закрепляется сверху, исключая необходимость искать проверенную информацию по крупицам.</li>
      </ul>
    </div>

    <div class="max-w-3xl">

    </div>

  </div>
</template>
<script setup>
</script>